
const additionalEffects = {
    "964559": {
        "Text": "Busterカード性能アップ",
        "Turn": 5,
        "Value": "20%"
    },
    "969079": {
        "Target": "敵単体",
        "Text": "強化状態を1つ解除",
        "Value": ""
    },
    "970272": {
        "Text": "毒（毎ターンHP）減少",
        "Turn": 3,
        "Count": 0,
        "Value": -500
    },
    "966566": {
        "Target": "味方全体",
        "Text": "攻撃力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "968051": {
        "Target": "味方全体",
        "Text": "攻撃力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "5%"
    },
    "970058": {
        "Text": "宝具威力アップ",
        "Turn": 5,
        "Count": 0,
        "Value": "20%"
    },
    "968983": {
        "Text": "スター発生率アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "968984": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "965948": {
        "Target": "敵単体",
        "Text": "Quickカード耐性ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "964745": {
        "Text": "攻撃力アップ",
        "Turn": 1,
        "Count": 0,
        "Value": "20%"
    },
    "965699": {
        "Target": "敵単体",
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "968344": {
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "968815": {
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "9640409": {
        "Text": "ローマ特性付与",
        "Turn": 3
    },
    "970400": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970436": {
        "Target": "自身",
        "Text": "〔精霊の怒り〕",
        "Turn": 5,
        "Value": ""
    },
    "970437": {
        "Target": "味方全体〔ワンジナ〕",
        "Text": "〔精霊の怒り〕",
        "Turn": 5,
        "Value": ""
    },
    "970444": {
        "Text": "クリティカル威力アップ",
        "Turn": 5,
        "Count": 1,
        "Value": ["30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "50%"]
    },
    "970445": {
        "Text": "強化成功率アップ",
        "Turn": 5,
        "Value": "15%"
    },
    "970447": {
        "Text": "スター獲得",
        "Value": "10個"
    },
    "970448": null,
    "970460": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Value": ["10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "20%"]
    },
    "970468": {
        "Text": "攻撃力威力アップ",
        "Turn": 3,
        "Value": "10%"
    },
    "970469": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Value": "10%"
    },
    "970470": {},
    "970477": {
        "Text": "やけど状態付与",
        "Turn": 3,
        "Value": "-500"
    },
    "970478": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Value": "10%"
    },
    "970479": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970480": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970482": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970481": {
        "Text": "被強化成功率ダウン",
        "Target": "敵単体",
        "Turn": 1,
        "Value": "-10%"
    },
    "970517": {
        "Text": "NP増加",
        "Value": "20%"
    },
    "970401": {
        "Text": "〔延焼〕状態",
        "Turn": 5,
        "Value": "50%"
    },
    "970518": [
        {
            "Text": "宝具威力アップ",
            "Turn": 6,
            "Value": "20%"
        },
        {
            "Text": "〔弱体〕状態を解除",
            "Value": ""
        }
    ],
    "970523": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970545": [
        {
        "Target": "敵単体",
        "Text": "HP回復量ダウン",
        "Turn": 3,
        "Value": "-20%"
        },
        {
            "Target": "敵単体",
            "Text": "低確率でチャージ減少",
            "Value": "-1"
        },
        {
            "Target": "敵単体",
            "Text": "〔ガッツ〕状態解除",
            "Value": ""
        }
    ],
    "970546": null,
    "970547": {
        "Text": "NP増加",
        "Value": "10%"
    },
    "970549": {
        "Text": "宝具威力アップ",
        "Value": "10%",
        "Turn": 3
    },
    "970554": {
        "Text": "HP回復",
        "Value": [
            "1000", "1100", "1200", "1300", "1400", "1500", "1600", "1700", "1800", "2000"
        ]
    },
    "992659": {
        "Text": "毒（毎ターンHP）減少",
        "Turn": 5,
        "Value": -1000
    },
    "968237": {
        "Text": "敵単体の 防御力ダウン",
        "Turn": 3,
        "Value": "-10%"
    },
    "930010": null,
    "990451": null,
    "970504": {
        "Text": "ガッツ発動時 HP回復",
        "Value": "HP2000",
    },
    "961269": {
        "Text": "",
        "Value": ""
    },
}

module.exports = {
    additionalEffects
}