
const additionalEffects = {
    "964559": {
        "Text": "Busterカード性能アップ",
        "Turn": 5,
        "Value": "20%"
    },
    "969079": {
        "Target": "敵単体",
        "Text": "強化状態を1つ解除",
        "Value": ""
    },
    "970272": {
        "Text": "毒（毎ターンHP）減少",
        "Turn": 3,
        "Count": 0,
        "Value": -500
    },
    "966566": {
        "Target": "味方全体",
        "Text": "攻撃力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "968051": {
        "Target": "味方全体",
        "Text": "攻撃力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "5%"
    },
    "970058": {
        "Text": "宝具威力アップ",
        "Turn": 5,
        "Count": 0,
        "Value": "20%"
    },
    "968983": {
        "Text": "スター発生率アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "968984": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Count": 0,
        "Value": "20%"
    },
    "965948": {
        "Target": "敵単体",
        "Text": "Quickカード耐性ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "964745": {
        "Text": "攻撃力アップ",
        "Turn": 1,
        "Count": 0,
        "Value": "20%"
    },
    "965699": {
        "Target": "敵単体",
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "968344": {
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "968815": {
        "Text": "防御力ダウン",
        "Turn": 3,
        "Count": 0,
        "Value": "-10%"
    },
    "9640409": {
        "Text": "ローマ特性付与",
        "Turn": 3
    },
    "970400": {
        "Text": "NP獲得",
        "Value": "10%"
    },
    "970436": {
        "Target": "自身",
        "Text": "〔精霊の怒り〕",
        "Turn": 5,
        "Value": ""
    },
    "970437": {
        "Target": "味方全体〔ワンジナ〕",
        "Text": "〔精霊の怒り〕",
        "Turn": 5,
        "Value": ""
    },
    "970444": {
        "Text": "クリティカル威力アップ",
        "Turn": 5,
        "Count": 1,
        "Value": ["30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "50%"]
    },
    "970445": {
        "Text": "強化成功率アップ",
        "Turn": 5,
        "Value": "15%"
    },
    "970447": {
        "Text": "スター獲得",
        "Value": "10個"
    },
    "970448": null,
    "970460": {
        "Text": "クリティカル威力アップ",
        "Turn": 3,
        "Value": ["10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "20%"]
    },
    "992659": {
        "Text": "毒（毎ターンHP）減少",
        "Turn": 5,
        "Value": -1000
    },
    "930010": null,
    "990451": null,
}

module.exports = {
    additionalEffects
}