const appendSkillNames = {
    '対ｾｲﾊﾞｰｸﾘﾃｨｶﾙ発生耐性': '対セイバークリティカル発生耐性',
    '対ﾗﾝｻｰｸﾘﾃｨｶﾙ発生耐性': '対ランサークリティカル発生耐性',
    '対ｱｰﾁｬｰｸﾘﾃｨｶﾙ発生耐性': '対アーチャークリティカル発生耐性',
    '対ﾗｲﾀﾞｰｸﾘﾃｨｶﾙ発生耐性': '対ライダークリティカル発生耐性',
    '対ｷｬｽﾀｰｸﾘﾃｨｶﾙ発生耐性': '対キャスタークリティカル発生耐性',
    '対ｱｻｼﾝｸﾘﾃｨｶﾙ発生耐性': '対アサシンクリティカル発生耐性',
    '対ﾊﾞｰｻｰｶｰｸﾘﾃｨｶﾙ発生耐性': '対バーサーカークリティカル発生耐性',
    '対ﾙｰﾗｰｸﾘﾃｨｶﾙ発生耐性': '対ルーラークリティカル発生耐性',
    '対ｱｳﾞｪﾝｼﾞｬｰｸﾘﾃｨｶﾙ発生耐性': '対アヴェンジャークリティカル発生耐性',
    '対ｱﾙﾀｰｴｺﾞｸﾘﾃｨｶﾙ発生耐性': '対アルターエゴクリティカル発生耐性',
    '対ﾌｫｰﾘﾅｰｸﾘﾃｨｶﾙ発生耐性': '対フォーリナークリティカル発生耐性',
    '対ﾑｰﾝｷｬﾝｻｰｸﾘﾃｨｶﾙ発生耐性': '対ムーンキャンサークリティカル発生耐性',
    '対ﾌﾟﾘﾃﾝﾀﾞｰｸﾘﾃｨｶﾙ発生耐性': '対プリテンダークリティカル発生耐性',
    '対ﾋﾞｰｽﾄｸﾘﾃｨｶﾙ発生耐性': '対ビーストクリティカル発生耐性',
    '対ｴｸｽﾄﾗｸﾗｽｸﾘﾃｨｶﾙ発生耐性': '対エクストラクラスクリティカル発生耐性',
}
module.exports = {
    appendSkillNames
}