

const targetNames = {
    "playerAndEnemy": {
        "self": "自身",
        "ptAll": "味方全体",
        "ptOne": "味方単体",
        "ptOther": "自身を除く味方全体",
        "ptOtherFull":  "自身を除く味方全体",
        "enemy": "敵単体",
        "enemyAll": "敵全体"
    },
    "player": {
        "self": "自身",
        "ptAll": "味方全体",
        "ptOne": "味方単体",
        "ptOther": "自身を除く味方全体",
        "ptOtherFull":  "自身を除く味方全体",
        "enemy": "敵単体",
        "enemyAll": "敵全体",
        "commandTypeSelfTreasureDevice": "自身",
    },
    "enemy": {
        "self": "",
        "ptAll": "",
        "ptOne": "",
        "player": "",
        "enemy": "敵単体",
        "enemyAll": "敵全体"
    }
}

const individualTargetNames = {
    "1": "〔男性〕",
    "2": "〔女性〕",
    "103": "〔ライダー〕",
    "109": "〔アルターエゴ〕",
    "115": "〔ムーンキャンサー〕",
    "200": "〔天〕",
    "201": "〔地〕",
    "202": "〔人〕",
    "300": "〔秩序〕",
    "301": "〔混沌〕",
    "303": "〔善〕",
    "304": "〔悪〕",
    "1132": "〔鬼〕",
    "1172": "〔人類の脅威〕",
    "2000": "〔神性〕",
    "2002": "〔竜〕",
    "2004": "〔ローマ〕",
    "2007": "〔アルトリア顔〕",
    "2008": "〔エヌマ・エリシュ〕",
    "2009": "〔騎乗スキル〕",
    "2010": "〔アーサー〕",
    "2011": "〔天または地の力を持つサーヴァント〕",
    "2012": "〔愛する者〕",
    "2019": "〔魔性〕",
    "2075": "〔セイバークラスのサーヴァント〕",
    "2076": "〔超巨大〕",
    "2113": "〔王〕",
    "2467": "〔急所判明〕 ",
    "2666": "〔巨人〕",
    "2759": "〔源氏〕",
    "2827": "〔いいね！〕",
    "2828": "〔王勇〕",
    "2839": "〔新撰組〕",
    "2840": "〔梁山泊〕",
    "2857": "〔聖杯所持〕",
    "2858": "〔7騎士のサーヴァント〕",
    "2880": "〔精霊の怒り〕",
    "3010": "〔精神異常〕",
    "3011": "〔毒〕",
    "3012": "〔魅了〕",
    "3015": "〔やけど〕",
    "3021": "〔回避〕",
    "3026": "〔呪い〕",
    "3025": "〔スキル封印〕"
}

module.exports = {
    targetNames,
    individualTargetNames
}